nerd_food/on_mingw_cygwin_and_wine.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-28 Sun 15:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nerd Food: On MinGW, Cygwin and Wine</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Nerd Food: On MinGW, Cygwin and Wine</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="../index.html">Back to home page</a></td>
<td class="org-left"><a href="index.html">Back to essay index</a></td>
</tr>
</tbody>
</table>

<p>
Friday, May 18, 2012
</p>

<p>
<b>Standard Disclaimer</b>: as with all posts in Nerd Food, this is a
summary of my notes and experience on the subject. Its likely there
will be incorrect bits of information so don't start building your
personal nuclear power station using this article. Or if you do, don't
blame me.
</p>

<div id="outline-container-orgbed534e" class="outline-2">
<h2 id="orgbed534e">UNIX Stranger on a Windows Strange Land</h2>
<div class="outline-text-2" id="text-orgbed534e">
<p>
Like pretty much every other UNIX nerd, I've been stranded on Windows
for long periods many times in my career. Whenever that happens,
cygwin is what keeps me sane and affords me a modicum of productivity
in hostile surroundings.
</p>

<p>
My relationship with Cygwin started in the long forgotten days of B19
when Men were Men and there was no setup.exe - just archives that were
unpacked manually. I even sent a post or two to the mailing list in
those days, or so Google says. One thing I never did was to write
about how Cygwin does its magic, and that's mainly because it has just
worked for the things I needed it to do. Recently I found myself doing
some more advanced stuff and it spurred me to write a post.
</p>

<p>
Before we can understand Cygwin, we need to get some fundamentals out
of the way. However, if you came here just to get a summary of
solutions and implications without necessarily understanding the
fundamentals, feel free to jump straight to Choosing the Environment
that Fits You.
</p>
</div>

<div id="outline-container-org8d3bc98" class="outline-3">
<h3 id="org8d3bc98">The Kernel and User Space</h3>
<div class="outline-text-3" id="text-org8d3bc98">
<p>
All operative systems share one feature in common: they all have a
kernel. The job of the average kernel is to do low-level stuff like
allowing multiple processes to share a physical machine without
getting on each others toes. The kernel does this and much, much more,
either through its core code or via dynamically loaded modules such as
the device drivers provided for your graphics card.
</p>

<p>
Kernels vary wildly in how they do things internally; that's why there
are so many different ones. Even more importantly - at least for our
purposes - they greatly differ on how they interface with the layers
above them, somewhat derogatorily known as the "user space". The
kernel exports an interface to the outside world, but this is normally
not meant to be consumed directly; instead users rely on higher-level
components to consume it. There are two sides of this interface: the
API and the ABI. Unfortunately, very frequently we use API to mean a
combination of both, but in reality there is a difference.
</p>
</div>
</div>

<div id="outline-container-org0ffc632" class="outline-3">
<h3 id="org0ffc632">The Kernel Application Programming Interface (API)</h3>
<div class="outline-text-3" id="text-org0ffc632">
<p>
When we talk about the API we normally mean a set of headers that can
be used to compile code that talks to the kernel directly. For a
simple example for the Linux kernel have a look at the Real Time Clock
Driver Test/Example Program. You can see it includes a linux kernel
header:
</p>

<pre class="code"><code><span style="color: #85DDFF; font-weight: bold;">#include</span> <span style="color: #C586C0;">&lt;</span><span style="color: #DB8E73;">stdio.h</span><span style="color: #C586C0;">&gt;</span>
<span style="color: #85DDFF; font-weight: bold;">#include</span> <span style="color: #C586C0;">&lt;</span><span style="color: #DB8E73;">linux/rtc.h</span><span style="color: #C586C0;">&gt;</span>
<span style="color: #85DDFF; font-weight: bold;">#include</span> <span style="color: #C586C0;">&lt;</span><span style="color: #DB8E73;">sys/ioctl.h</span><span style="color: #C586C0;">&gt;</span>
...
</code></pre>

<p>
These are used to talk directly to the RTC, using standard calls such
as ioctl, etc.
</p>
</div>
</div>

<div id="outline-container-org175e1a1" class="outline-3">
<h3 id="org175e1a1">The Kernel Application Binary Interface (ABI)</h3>
<div class="outline-text-3" id="text-org175e1a1">
<p>
From a kernel perspective, its best to think of the ABI as a
specification that allows stitching together binary components. The
ABI is actually huge, and encompasses very many different aspects,
such as:
</p>

<ul class="org-ul">
<li>The system call ABI, exemplified here for linux. It describes how
function calls are setup, how the stack gets cleaned up after the
function call, etc.</li>
<li>The object file format, responsible for describing the layout of
binaries such as executables and shared libraries. Most Unices
support ELF or the older COFF or the even older a.out; Windows uses
PE.</li>
</ul>

<p>
Finally, one last word on internal versus external ABI. Linux tries
very hard to make sure the external ABI is kept stable; this is why
you can run the same binaries on pretty much any version of the kernel
(all things being equal, such as the presence of all dependencies
required by the binary). However, Linux makes no guarantees whatsoever
with regards to the internal ABI. This means you cannot compile device
drivers for a version of the kernel and expect them to work with other
versions; they may, but then again they may not. Windows takes the
opposite approach, trying hard not to break binary compatibility.
</p>
</div>
</div>

<div id="outline-container-orgc599742" class="outline-3">
<h3 id="orgc599742">UNIX and The C Library</h3>
<div class="outline-text-3" id="text-orgc599742">
<p>
It is somewhat tautological to say that, on UNIX, the outer edge of
user space begins with the C POSIX Library. It contains all of what is
available on the C Standard Library - that is, the library of
functions and types created for the C programming language - and, in
addition, it also contains POSIX extensions. It may also contain other
non-standard extensions, but we'll ignore these for the sake of
simplification.
</p>

<p>
This entire package is what we commonly call the C Library. If you use
Linux you are probably using glibc, the GNU implementation of the C
Library. Furthermore:
</p>

<ul class="org-ul">
<li>When people refer to the C runtime (CRT) they normally mean the
shared object (or dynamically linked library) providing the binary
implementation of the C Standard Library;</li>
<li>to <i>link statically</i> against the C runtime means that your
application will contain the entire run-time rather than share one
with other applications.</li>
</ul>

<p>
Now, its important to bear in mind that there's nothing particularly
magical about the C library; is just a set of functions defined by the
C programming language and the POSIX standardisation
process. Externally it looks like pretty much any other library. What
tends to make the C Library a bit special is that pretty much
everything on a UNIX system depends on it in one form or
another. Also, unlike other libraries, the C Library makes use of
kernel APIs to implement the interfaces it exports, and as such it
shields the layers above from the vagaries of any particular kernel.
</p>

<p>
You are probably wondering if these functions would not also be useful
to the kernel itself. After all, it is more often than not built in C,
right? Unfortunately, due to the highly circular nature of the
problem, the kernel cannot make use of the C Library. The kernel uses
what is commonly referred to as pure C; that is, only the core C
language itself. It must provide its own implementation of all
required functions, which can be inspired by code in the C library.
</p>
</div>
</div>
</div>
