nerd_food/on_mingw_cygwin_and_wine.html

<div id="outline-container-org183453a" class="outline-2">
<h2 id="org183453a">The Windows API</h2>
<div class="outline-text-2" id="text-org183453a">
<p>
On Windows - as always - things are not quite as simple. The Windows
API is the equivalent outer edge of user space on Windows-land (when I
say API here, I really mean API + ABI, which is traditionally what
people mean). Instead of a nice separation of core APIs that interface
with the kernel, the Windows API appears to users as one big monolith
with many, many responsibilities all bundled together. In reality, its
actually made up of a great number of distinct libraries, but that's
not how it seems to the untrained eye.
</p>

<p>
As far as the C Library is concerned, well, it has no direct equivalent. The C Standard Library exists on Windows, of course, but its not seen as a core component of the operative system; its more of a add-on which you can install if required. If one could access the source, one imagines that its implementation makes use of Windows API calls rather than calling the kernel directly - but this is gross speculation from my part. Implementation details aside, its fair to say that the C Standard Library works just fine on Windows.
</p>

<p>
The crux of all our problems is the POSIX API. When a UNIX developer
means "POSIX" he or she means the whole shebang: threads, processes,
sockets, etc. - pretty much a complete wrapper around the
functionality provided by the kernel. Unfortunately, POSIX is very
much a suite of standards, and its not hard to cherry pick the easier
bits and claim compliance for marketing purposes; this was what
Microsoft did in the NT 3.51 days.
</p>

<p>
To be fair to Microsoft, these days they provide a decent
implementation on their high-end systems (Interix, or Subsystem for
Unix-based Applications, can't quite keep up with the names). However,
its not everywhere by default and its a bit too late to fix the damage
done by its absence.
</p>

<p>
The other thing to notice is the potential impedance mismatch between
the NT kernel API and POSIX. The NT kernel comes from a VMS heritage
and as such is further apart from POSIX, which was in many ways the
standardisation of what was then current UNIX practice. The further
apart these two are, the higher the cost of the translation.
</p>
</div>

<div id="outline-container-org039af1d" class="outline-3">
<h3 id="org039af1d">The many facets of Cygwin</h3>
<div class="outline-text-3" id="text-org039af1d">
<p>
It should be fairly clear by now what the first role of Cygwin is: it
aims to provide the missing POSIX API and run time that is required by
the majority of applications designed for Linux and other Unices. This
it provides via its many DLLs such as cygwin.dll. So all software that
runs on Cygwin requires these DLLs - very much like the C Library on
Linux is a central dependency.
</p>

<p>
The second aspect of Cygwin is a bit less obvious. In my quest to
explain hows things work I simplified things a bit: POSIX is not only
a set of APIs - its also an environment. Yep you heard that right, it
is well within the rights of POSIX applications to expect the presence
of the Bourne shell (sh) and a host of other utilities such as make
and ls.
</p>

<p>
You may argue that a large number of applications can happily function
without bash or ls. Indeed they can - at run-time; however, bear in
mind that someone has to build these applications somewhere and it is
this very compilation process that tends to require a POSIX
environment. Visual Studio does contain fairly capable C and C++
compilers, and one can even access them for free these days using the
Express Edition; however, this is a recent development and as such
most Linux applications do not have Visual Studio solutions or msbuild
files, so its not possible to build them directly from Visual Studio.
</p>

<p>
The second aspect of Cygwin is then to provide this environment under
which to build applications - loosely called a toolchain. As the DLL
got closer and closer to POSIX, more and more software has been ported
over, making the toolchain closer and closer to Linux; this in turn
has made the porting of additional software easier, and the process
fed on itself. These days the traditional configure, make and make
install are likely to work for a very large number of applications
available on a Linux distribution; most of these are the applications
shipped with Cygwin, the distribution - its third aspect.
</p>

<p>
As with everything in life, there's always a cost. You may have heard
complaints about Cygwin's performance. Personally I can't moan too
much but I guess that if you are running performance sensitive code
such as say PostgreSQL under high loads you are likely to notice
it. This is for two reasons:
</p>

<ul class="org-ul">
<li>there is a natural impedance mismatch between the Windows API and
POSIX, as described on the previous section; ironing out this
mismatch has to cost CPU cycles;</li>
<li>as a regular Windows denizen, Cygwin has to go via the public
Windows API instead of talking directly to the kernel, and as such
misses some potential optimisations that Interix/SUA may be using.</li>
</ul>
</div>
</div>
