nerd_food/on_mingw_cygwin_and_wine.org
** MinGW and MSYS

Some people are not happy with the dependency on Cygwin, either due to
the performance reasons outlined above or due to its fairly viral GPL
licence. MinGW tries to plug this gap in the market, providing the
following:

- a native port of the GNU toolchain to Windows, including GCC, make,
  etc. These are full-blown windows applications with no other
  dependencies;
- the MinGW run-time: headers and lib files that allow compiling
  against the Microsoft C Standard Library;
- a set of Windows API headers required to compile code against the
  Windows API.

With these three things one can build native Windows applications that
do not rely on POSIX at all (they can, of course, rely on any POSIX
functionality Windows may offer directly).

As explained previously, many applications require a POSIX environment
on which to build; for instance they may make use of shell scripts so
bash is a requirement. To aid in this department, MinGW comes with
MSYS, which is effectively an extremely cut-down fork of Cygwin that
contains a very minimalist environment with bash, ls and so on. While
it may work out of the box for simple use cases, you may find its a
bit too basic for non-trivial applications. For instance we found that
the version of tar supplied didn't support 32-bit GIDs, causing a lot
of spurious warnings. If a basic package like tar, which is trivially
used for installing software, must be tinkered with in order to work
you can imagine the difficulties in compiling large and complex
applications. This is probably not a problem for the typical low-level
MinGW user, probably accustomed to embedded development, but it makes
it slightly less accessible to the casual developer not interested in
the guts of the implementation.

As you probably already guessed, nothing stops you from using MinGW
from within Cygwin; in fact, it's available as a package. Doing this
gives you the advantages of a full-blown POSIX environment in which to
build, rather than the spartan MSYS, whilst still allowing you to
generate binaries that do not require Cygwin to run. If you do not
want to spend time setting up basic environmental details then Cygwin
is the right choice for a key-in-hand solution for a UNIX environment
on Windows.

More interesting still, you can run MinGW directly on Linux. Once GCC
was taught how to generate binaries for the Windows platform, the next
logical step was to allow it to cross-compile these binaries in
Linux. This basically means that a MinGW version of GCC is available
on your Linux distribution as an ELF binary which is able to generate
PE binaries that can be executed on Windows. In this case you won't
need MSYS as Linux already provides you with a POSIX environment in
which to build. To put things slightly more technically, you can use
Linux as both the build and host system, and generate binaries that
target Windows.

Finally, a word about MinGW-w64. Originally MinGW only targeted
Windows 32-bit - hence why you may see MinGW32 in a lot of places; as
64-bit became more popular, a compiler for it was required - that's
where MinGW-w64 came in. These days it provides both 32-bit and 64-bit
compilers and it distinguishes itself by both covering more of the
Windows API and providing really recent GCC releases. For instance,
snapshots of GCC 4.8 are already available from their download site.

* Wine

A word on Wine is required for symmetry purposes. In many ways, Wine
is the mirror image of Cygwin, in that it provides the Windows API to
Linux; but its important to note that whereas Cygwin requires you to
compile your sources and generate PE binaries to run on Windows, Wine
actually goes one step further and allows running the PE binaries
directly on Linux without any modification.

This is much, much more difficult. I can't stress enough that Wine is
not providing an emulator or VM to run PE binaries - just like Cygwin
is not providing an emulator to run ELF binaries. Instead, and unlike
Cygwin, Wine provides a program loader that understands the PE format
and is responsible for loading them into memory (you can read about
all the gory details here.). Wine also has to provide all the headers
for the Windows API so that you can compile full-blown Windows
applications on Linux. And, of course, it provides a clean room
implementation of the Windows API itself in order for you to be able
to run the binaries.

One can imagine that it could be possible to recompile the entire
Windows API under linux using ELF and then compile and run perfectly
happy applications. Not withstanding any technical challenges - half
of windows is probably hard-coded to use PE - this would not be a
particularly useful thing to do because it would then require
recompiling every other windows application under Linux and since we
don't have the source for them this is a non-starter. For Cygwin it
makes perfect sense, but not for Wine.

MinGW shines on Wine too because you can now build and run Windows
applications on Linux without requiring windows at all. Wine provides
its won version of MinGW called winegcc.

* Choosing the Environment that Fits You

If you need to develop on Windows or for Windows, the following
checklist may be of assistance:

- *Are you building and targeting only Windows?* Use Visual Studio
  with Cygwin to provide you with a nice UNIX like environment with
  bash, grep and the like. This gives you the best compiler for your
  platform. You will have to deal with the many quirks of Visual
  Studio, but on the plus side you can run a lot of it from the
  command line. Using CMake to generate solutions will make things
  even easier.
- *Are you developing from Linux but targeting Windows?* Use a MinGW
  cross-compiler to produce the binaries and Wine to test the binaries
  locally.
- *Do you need to target both Linux as well as Windows and your code
  is very POSIX dependent?* You will probably need either Cygwin or
  Interix. If your software is closed source, you will have to pay
  RedHat a licence to use Cygwin.
- *Do you need to target both Linux as well as Windows and your code
  is not too POSIX dependent?* Use MinGW to build on Windows and
  regular GCC to build on Linux. If you want a lightweight POSIX
  environment to minimise the risk of unwanted and unnecessary
  dependencies, use MSYS. It will provide you with a bare-bones
  environment but it will also allow you to compile against something
  very close to the windows API. If you need a richer POSIX
  environment use MinGW from Cygwin.
- *Do you want to use GCC on Windows without UNIX?* Install MinGW and
  use GCC from a cmd.exe shell. If you need a UI, use CodeBlocks.

We're avoiding the more exotic scenarios such as building Linux
binaries on Windows or running Cygwin on Wine.

Date: 2012-05-18 18:28:41 BST

Org version 7.8.02 with Emacs version 23
